# systemverilog design
read_slang -C resolver.flist --top northcape_cap_resolver_wrapper_verilog -I ../../../hardware/include/northcape/mmu -I ../../../hardware/include/northcape/common -I ../../../hardware/include/northcape/capability_resolver -I ../../../hardware/include/northcape/capability_ops -I ../../../hardware/include/northcape/ariane -I ../../../hardware/include/northcape/xilinx -I ../../../hardware/include/northcape/tests/coverage -I ../../../hardware/include/northcape/tests/uvm_wrapper -I ../../../hardware/hdl/block_design_wrappers/ -D ASIC -D VERILATOR --ignore-assertions
# synthesis needed here - otherwise, can generate unknown primitives
synth -top northcape_cap_resolver_wrapper_verilog
# write as "simple" verilog
write_verilog northcape_cap_resolver_flattened.v
